УТ_для_edt/src/Catalogs/CRM_СпискиРассылок/CRM_СпискиРассылок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СпискиРассылок</name>
  <attributes>
    <name>ЗагруженИзMSExchange</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.Партнеры</types>
        <types>CatalogRef.CRM_СпискиРассылок</types>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактСтрокой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипКонтакта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_СпискиРассылок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Получить состав списка рассылки
//
// Параметры:
//  Ссылка						 - Ссылка, СправочникСсылка.CRM_СпискиРассылок	 - Ссылка на элемент справочника
//  МассивРезультат				 - Массив										 - Возвращаяемый список контактов.
//  МассивОбработанныхСписков	 - Массив										 - Обработанные строки контактов.
// 
// Возвращаемое значение:
//  МассивРезультат - Массив - Возвращаяемый список контактов.
//
Функция ПолучитьСоставСпискаРассылки(Ссылка, МассивРезультат = Неопределено, МассивОбработанныхСписков = Неопределено) Экспорт
	Если МассивРезультат = Неопределено Тогда
		МассивРезультат = Новый Массив();
	КонецЕсли;
	Если МассивОбработанныхСписков = Неопределено Тогда
		МассивОбработанныхСписков = Новый Массив();
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Состав.Адрес КАК Адрес,
	|	Состав.Контакт КАК Контакт,
	|	Состав.КонтактСтрокой КАК КонтактСтрокой
	|ИЗ
	|	Справочник.CRM_СпискиРассылок.Состав КАК Состав
	|ГДЕ
	|	Состав.Ссылка = &Ссылка
	|	И НЕ Состав.Ссылка.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.Адрес) И Не ЗначениеЗаполнено(Выборка.Контакт) Тогда
			Продолжить;
		КонецЕсли;
		
		Если	ТипЗнч(Выборка.Контакт) = Тип("СправочникСсылка.CRM_СпискиРассылок")
			И	МассивОбработанныхСписков.Найти(Выборка.Контакт) = Неопределено Тогда
			//
			МассивОбработанныхСписков.Добавить(Выборка.Контакт);
			ПолучитьСоставСпискаРассылки(Выборка.Контакт, МассивРезультат, МассивОбработанныхСписков);
		Иначе
			МассивРезультат.Добавить(Новый Структура("Адрес,Контакт", Выборка.Адрес, ?(ЗначениеЗаполнено(Выборка.Контакт), Выборка.Контакт, 
				?(ЗначениеЗаполнено(Выборка.КонтактСтрокой),Выборка.КонтактСтрокой,Неопределено))));
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивРезультат;
КонецФункции

#КонецОбласти

#КонецЕсли
